In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({ 'col1' : [1,2,3,4],
                   'col2' : [444,555,667,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   667  ghi
3     4   444  xyz

In [4]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   667  ghi
3     4   444  xyz

In [6]:
df['col2'].unique() #returns the unique values in a col

array([444, 555, 667])

In [7]:
df['col2'].nunique() # returns the number of unique values in a col

3

In [8]:
df['col2'].value_counts() #returns the frequency of each value in the col

444    2
555    1
667    1
Name: col2, dtype: int64

In [12]:
df[(df['col1']>2) & (df['col1'] <4)]

   col1  col2 col3
2     3   667  ghi

In [13]:
def times2(x):
    return x*2

In [15]:
df['col1'].apply(times2) #apply allows you to perform a function on the values of the col

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col2'].apply(lambda x:x*2) #times2 func but using lambda expressions

0     888
1    1110
2    1334
3     888
Name: col2, dtype: int64

In [18]:
df.drop('col1', axis = 1)

   col2 col3
0   444  abc
1   555  def
2   667  ghi
3   444  xyz

In [20]:
df.columns #returns the titles of the columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [21]:
df.index #returns the list of index titles

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   667  ghi

In [24]:
df.isnull() #returns a boolean that is true if there is a null value

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [26]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [27]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [ ]:
df.pivot_table()